module.exports = {
  up: (queryInterface, Sequelize) => {
    return queryInterface.bulkInsert("providers", [
      {
        providerTitle: "persia",
        telephone: "07136245649",
        fax: "07136359305",
        email: "persia.azmasystem1@gmail.com",
        address:
          "شیراز، بلوار دکترحسابی، شهرک آرین، خیابان فناوری، پارک علم و فناوری، ساختمان آپادانا، واحد 2109، شرکت پرشیا آزما سیستم",
        aboutUs:
          "شرکت دانش بنیان پرشیا آزما سیستم با رویکردی متفاوت در ارائه خدمات تخصصی کالیبراسیون تجهیزات ابزاردقیق، پزشكي و آزمایشگاهی و پشتیبانی فنی تجهیزات پزشکی با بهره گیری از تجربه و تخصص اساتید بلندپایه کشور در جایگاه مدیریتی و آموزشی و بکارگیری پرسنل مجرب و متخصص در جایگاه کارشناسی و اجرایی با مجوز از سازمان ملی استاندارد ایران، اداره کل تجهیزات پزشکی وزارت بهداشت و سازمان انرژی اتمی ایران و تحت نظارت این مراجع به صورت خاص اقدام به فعالیت به عنوان آزمایشگاه آزمون و کالیبراسیون تائید صلاحیت شده در استان فارس نموده است. آزمایشگاه های این شرکت در پارک علم و فناوری شیراز واقع شده است و بسیاری از مراکز درمانی دولتی و خصوصی در سطح استان فارس از کشتریان این شرکت بوده و از خدمات کالیبراسیون و کنترل کیفیت این شرکت بهره مند شده اند. از جمله اهداف استراتژیک این شرکت بسط حوزه فعالیت کاری در کشور و به طور خاص استان های جنوب کشور است که در این راستا پروژه هایی زیادی در استان های کرمان، بوشهر، هرمزگان، خوزستان، ایلام، سیستان و بلوچستان و کهکیلویه و بویراحمد در چند سال اخیر پیاده سازی و اجرا شده است. این شرکت براساس توانمندی ها و بهرمندي از پتانسیل های سخت افزاری و نرم افزاری خود و عقد قراردادهای همکاری ملی و بین المللی با شرکتهای معتبر در زمینه های زیر مشغول به فعالیت و ارائه خدمات میباشد",
        createdAt: new Date(),
        updatedAt: new Date(),
      },
      {
        providerTitle: "datis",
        telephone: "07132346668",
        fax: "07132346669",
        email: "farzad.sh.2020@example.com",
        address:
          "شیراز، ورودی اول شهر صدرا، خیابان بیمارستان امیرالمومنین (ع)، پارک فناوری سلامت شیراز، شرکت داتیس فناوری پرتو برتر",
        aboutUs:
          "شرکت داتیس فناور برتر با رویکردی متفاوت در ارائه خدمات تخصصی نگهداشت تجهیزات پزشكي و آزمایشگاهی و پشتیبانی فنی این تجهیزات با بهره گیری از تجربه و تخصص اساتید بلندپایه کشور در جایگاه مدیریتی و آموزشی و بکارگیری پرسنل مجرب و متخصص در جایگاه کارشناسی و اجرایی به صورت خاص اقدام به فعالیت در استان فارس نموده است. در چند سال اخیر و باتوجه به فراگیری فرایندهای کنترل کیفیت، تضمین کیفیت نتایج و صحه‌گذاری روش‌های آزمون در آزمایشگاه های تخصصی، این شرکت براساس توانمندی های فنی خود و عقد قراردادهای همکاری ملی و بین المللی با شرکتهای معتبر نسبت به تهیه و ارائه مواد مرجع (RM & CRM) که نقش بسیار مهمی در توسعه روش های آنالیزی دارند اقدام نموده است. این مواد در فرایندهای ارزیابی صحت نتایج تجهیزات اندازه گیری، اعتبارسنجی روش های آنالیزی، تخمین عدم قطعیت اندازه گیری، اهداف کنترل و تضمین کیفیت و مقایسه نتایج بین آزمایشگاهی نقش کاربردی زیادی دارند. از دیگر محورهای عملیاتی شرکت، پیاده سازی و برقراری سیستم های نگهداشت موثر تجهیزات پزشکی در مراکز درمانی است. یک سیستم نگهداشت موثر تجهیزات پزشکی از اهمیت زیادی برخوردار است که به مهمترین آنها میتوان به ایمنی بیماران و کادر درمان، صرفه‌جویی در هزینه‌ها و بهبود کیفیت خدمات درمانی اشاره نمود. مرکز فنی تخصصی و آزمایشگاه مرجع این شرکت در پارک فناوری سلامت شیراز واقع شده است و بسیاری از مراکز درمانی در سطح استان فارس از مشتریان این شرکت بوده و از خدمات نگهداشت و سرویس و نگهداری تجهیزات این شرکت بهره-مند شده اند. از جمله اهداف استراتژیک این شرکت بسط حوزه فعالیت کاری در سطح استان های جنوب کشور است که در این راستا پروژه هایی در استان های بوشهر، هرمزگان و کهکیلویه و بویراحمد در چند سال اخیر پیاده سازی و اجرا شده است. این شرکت براساس توانمندی ها و بهرمندي از پتانسیل های سخت افزاری و نرم افزاری خود و عقد قراردادهای همکاری ملی و بین المللی با شرکتهای معتبر در زمینه های زیر مشغول به فعالیت و ارائه خدمات می باشد.",
        createdAt: new Date(),
        updatedAt: new Date(),
      },
    ]);
  },
  down: (queryInterface, Sequelize) => {
    // return queryInterface.bulkDelete('Users', null, {});
  },
};
